; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v1)
		(pred_3 ?v8)
		(pred_6 ?v3)
		(pred_1 ?v3)
		(pred_2 ?v8 ?v3)
		(pred_4)
		(pred_5 ?v8))

   (:action op_1
       :parameters  (?v2 ?v7)
       :precondition (and (not-eq ?v2 ?v7) 
                          (pred_6 ?v2) (pred_6 ?v7) (pred_1 ?v2))
       :effect (and  (pred_1 ?v7)
		     (not (pred_1 ?v2))))


   (:action op_3
       :parameters (?v4 ?v6)
       :precondition  (and  (pred_3 ?v4) (pred_6 ?v6)
			    (pred_2 ?v4 ?v6) (pred_1 ?v6) (pred_4))
       :effect (and (pred_5 ?v4)
		    (not (pred_2 ?v4 ?v6)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v4  ?v6)
       :precondition  (and  (pred_3 ?v4) (pred_6 ?v6)
			    (pred_5 ?v4) (pred_1 ?v6))
       :effect (and (pred_2 ?v4 ?v6)
		    (pred_4)
		    (not (pred_5 ?v4)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_05 obj_04 obj_02 obj_06 
          obj_03 obj_01 obj_07 
)
(:init
(pred_6 obj_05)
(pred_6 obj_04)
(pred_6 obj_02)
(pred_6 obj_06)
(pred_3 obj_03)
(pred_3 obj_01)
(pred_3 obj_07)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(pred_4)
(pred_2 obj_03 obj_06)
(pred_2 obj_01 obj_04)
(pred_2 obj_07 obj_06)
(pred_1 obj_04)
)
(:goal
(and
(pred_2 obj_03 obj_04)
(pred_2 obj_01 obj_06)
(pred_2 obj_07 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_03 obj_04) (pred_1 obj_05))
    (sometime-before  (pred_2 obj_01 obj_06) (pred_1 obj_05))
  )
)
)

; plan
1. (op_3 obj_01 obj_04)
   deleted: (pred_2 obj_01 obj_04) (pred_4)
   added: (pred_5 obj_01)
   goals met: 1 of 3
2. (op_1 obj_04 obj_05)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_05)
   goals met: 1 of 3
3. (op_2 obj_01 obj_05)
   deleted: (pred_5 obj_01)
   added: (pred_2 obj_01 obj_05) (pred_4)
   goals met: 1 of 3
4. (op_1 obj_05 obj_06)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_06)
   goals met: 1 of 3
5. (op_3 obj_03 obj_06)
   deleted: (pred_2 obj_03 obj_06) (pred_4)
   added: (pred_5 obj_03)
   goals met: 1 of 3
6. (op_1 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 1 of 3
7. (op_2 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_2 obj_03 obj_04) (pred_4)
   goals met: 2 of 3
8. (op_1 obj_04 obj_05)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_05)
   goals met: 2 of 3
9. (op_3 obj_01 obj_05)
   deleted: (pred_2 obj_01 obj_05) (pred_4)
   added: (pred_5 obj_01)
   goals met: 2 of 3
10. (op_1 obj_05 obj_06)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_06)
   goals met: 2 of 3
11. (op_2 obj_01 obj_06)
   deleted: (pred_5 obj_01)
   added: (pred_2 obj_01 obj_06) (pred_4)
   goals met: 3 of 3
